---
kind: property
id: P:Autodesk.Revit.DB.Electrical.PanelScheduleData.PhasesAsCurrents
source: html/50bd4c92-f81a-7f5c-01cc-92d49e7fd56f.htm
---
# Autodesk.Revit.DB.Electrical.PanelScheduleData.PhasesAsCurrents Property

If true, the phase columns are currents (A), otherwise they are loads (VA); setting this value must go through the appropriate update function

## Syntax (C#)
```csharp
public bool PhasesAsCurrents { get; }
```